
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       18 |          10 |           18 |
## Affected resources by action

|  Action  | Resources                                                                      |
|:--------:|:-------------------------------------------------------------------------------|
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                   |
|    🟡    | `module.actions-runner.aws_autoscaling_policy.scale_out`                       |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`             |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_policy.scale_out`                 |
|    🟡    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`       |
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`        |
|    🟡    | `module.actions-runner.module.registration.aws_lambda_function.main`           |
|    🟡    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda` |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`  |
|    🟡    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`     |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 60 -> 0
        id                               = "actions-runner-20250505203133108100000007-INx3ry"
      ~ max_size                         = 3 -> 1
        name                             = "actions-runner-20250505203133108100000007-INx3ry"
        # (29 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-08b47595a3bdafaf1"
                  + version            = "2"
                }
              + override (known after apply)
            }
        }

      - warm_pool {
          - max_group_prepared_capacity = 2 -> null
          - min_size                    = 2 -> null
          - pool_state                  = "Hibernated" -> null

          - instance_reuse_policy {
              - reuse_on_scale_in = true -> null
            }
        }

        # (12 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 180 -> 0
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
      ~ health_check_grace_period        = 60 -> 0
        id                               = "actions-runner-20250505203133193000000009-KWX4No"
        name                             = "actions-runner-20250505203133193000000009-KWX4No"
        # (30 unchanged attributes hidden)

      ~ warm_pool {
          ~ max_group_prepared_capacity = 2 -> 3
            # (2 unchanged attributes hidden)

          ~ instance_reuse_policy {
              ~ reuse_on_scale_in = true -> false
            }
        }

        # (12 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_out will be updated in-place
  ~ resource "aws_autoscaling_policy" "scale_out" {
      ~ cooldown                  = 180 -> 0
        id                        = "scale-out-idle-runners"
        name                      = "scale-out-idle-runners"
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_deregistration"
      ~ last_modified                  = "2025-05-13T20:54:41.000+0000" -> (known after apply)
      ~ s3_key                         = "fe641a97-8ac0-4f13-095d-088a20e0a3a6.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/fe641a97-8ac0-4f13-095d-088a20e0a3a6.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "843f680e26c6138f8b4eeb509a325244-5" -> (known after apply)
      ~ id                            = "fe641a97-8ac0-4f13-095d-088a20e0a3a6.zip" -> (known after apply)
      ~ key                           = "fe641a97-8ac0-4f13-095d-088a20e0a3a6.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_deregistration/fe641a97-8ac0-4f13-095d-088a20e0a3a6.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2229904302624480056" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "fe641a97-8ac0-4f13-095d-088a20e0a3a6" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
      ~ result  = "fe641a97-8ac0-4f13-095d-088a20e0a3a6" -> (known after apply)
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_record_metric"
      ~ last_modified                  = "2025-05-13T20:35:00.000+0000" -> (known after apply)
      ~ s3_key                         = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "67e8fbbcc905a43da0e68531a606beda-5" -> (known after apply)
      ~ id                            = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> (known after apply)
      ~ key                           = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/record_metric/00be4eb3-3a13-f57e-b6d8-e9d970c9089b.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "1272859802952914355" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
      ~ result  = "00be4eb3-3a13-f57e-b6d8-e9d970c9089b" -> (known after apply)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133108100000007-INx3ry_registration"
      ~ last_modified                  = "2025-05-13T20:54:41.000+0000" -> (known after apply)
      ~ s3_key                         = "a97ca980-5c52-cc1e-0bcf-b37a766b5836.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/a97ca980-5c52-cc1e-0bcf-b37a766b5836.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "2a3b078378b0a38e0f0c75b99160f038-5" -> (known after apply)
      ~ id                            = "a97ca980-5c52-cc1e-0bcf-b37a766b5836.zip" -> (known after apply)
      ~ key                           = "a97ca980-5c52-cc1e-0bcf-b37a766b5836.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_registration/a97ca980-5c52-cc1e-0bcf-b37a766b5836.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "5343930296684095290" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "c9bc5cebad6b81307c300f8d1e09723a" -> "34bff39de72b4ecc4ae42adb06cd966d"
          ~ "main_version"         = "f9ec518ccebbfddf2a90c8883410c99b" -> "cfe52089dc4c9e78f304e673a993d130"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "a97ca980-5c52-cc1e-0bcf-b37a766b5836" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "f9ec518ccebbfddf2a90c8883410c99b" -> "cfe52089dc4c9e78f304e673a993d130"
          ~ "requirements.txt" = "c9bc5cebad6b81307c300f8d1e09723a" -> "34bff39de72b4ecc4ae42adb06cd966d"
        }
      ~ result  = "a97ca980-5c52-cc1e-0bcf-b37a766b5836" -> (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_deregistration"
      ~ last_modified                  = "2025-05-13T20:54:41.000+0000" -> (known after apply)
      ~ s3_key                         = "0c9c1320-6e95-b44f-9537-104bb7f7bc1e.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/0c9c1320-6e95-b44f-9537-104bb7f7bc1e.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "51ee905f0b0ba4f8b0be2c01bb47ffea-5" -> (known after apply)
      ~ id                            = "0c9c1320-6e95-b44f-9537-104bb7f7bc1e.zip" -> (known after apply)
      ~ key                           = "0c9c1320-6e95-b44f-9537-104bb7f7bc1e.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/0c9c1320-6e95-b44f-9537-104bb7f7bc1e.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "119974147521773078" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "0c9c1320-6e95-b44f-9537-104bb7f7bc1e" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
      ~ result  = "0c9c1320-6e95-b44f-9537-104bb7f7bc1e" -> (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_record_metric"
      ~ last_modified                  = "2025-05-13T20:35:00.000+0000" -> (known after apply)
      ~ s3_key                         = "c37c20b1-61bf-8577-529a-51f28b95d3d7.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/c37c20b1-61bf-8577-529a-51f28b95d3d7.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "d182ee50e71bd3909f503f2021f9c728-5" -> (known after apply)
      ~ id                            = "c37c20b1-61bf-8577-529a-51f28b95d3d7.zip" -> (known after apply)
      ~ key                           = "c37c20b1-61bf-8577-529a-51f28b95d3d7.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/record_metric/c37c20b1-61bf-8577-529a-51f28b95d3d7.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "8477583450196777652" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "c37c20b1-61bf-8577-529a-51f28b95d3d7" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "6538831741a0f02462174590f7abb061" -> "34bff39de72b4ecc4ae42adb06cd966d"
            # (1 unchanged element hidden)
        }
      ~ result  = "c37c20b1-61bf-8577-529a-51f28b95d3d7" -> (known after apply)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250505203133193000000009-KWX4No_registration"
      ~ last_modified                  = "2025-05-13T20:54:41.000+0000" -> (known after apply)
      ~ s3_key                         = "fb5a75ef-ec5a-1aec-833c-96ee580a7c80.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/fb5a75ef-ec5a-1aec-833c-96ee580a7c80.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "15a2faaaad144d68d1a803ab95844d6d-5" -> (known after apply)
      ~ id                            = "fb5a75ef-ec5a-1aec-833c-96ee580a7c80.zip" -> (known after apply)
      ~ key                           = "fb5a75ef-ec5a-1aec-833c-96ee580a7c80.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/fb5a75ef-ec5a-1aec-833c-96ee580a7c80.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "1827976112852475956" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "c9bc5cebad6b81307c300f8d1e09723a" -> "34bff39de72b4ecc4ae42adb06cd966d"
          ~ "main_version"         = "f9ec518ccebbfddf2a90c8883410c99b" -> "cfe52089dc4c9e78f304e673a993d130"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "fb5a75ef-ec5a-1aec-833c-96ee580a7c80" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "f9ec518ccebbfddf2a90c8883410c99b" -> "cfe52089dc4c9e78f304e673a993d130"
          ~ "requirements.txt" = "c9bc5cebad6b81307c300f8d1e09723a" -> "34bff39de72b4ecc4ae42adb06cd966d"
        }
      ~ result  = "fb5a75ef-ec5a-1aec-833c-96ee580a7c80" -> (known after apply)
    }

Plan: 18 to add, 10 to change, 18 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDE4LCAiY2hhbmdlIjogMTAsICJkZXN0cm95IjogMTh9fQ==
```
</details>